clear
clc


% x=[0.17453 0.5236 0.87267 1.22173 1.5708 1.91986 2.26893];
% y=[0.00162 0.00252 0.00498 0.0129 0.03964 0.1207 0.34097];
x=(-2:1:4);
y=x.^2;
N=length(x);
b=zeros(1,N);
f=zeros(N-1);%i,j i-строка f(x0,..,xi)
%строим интерпол€ционный многочлен
b(1)=y(1);
for j=1:N-1
        f(1,j)=(y(j+1) -y(j) )/(x(j+1) -x(j));
end
for i=2:N-1
    for j=1:N-i
        f(i,j)=(f(i-1,j+1) -f(i-1,j) )/(x(j+i) -x(j));
    end
end
b(2:N)=f(:,1);

a=newton2pol(b,x)
y2=polyval(a(N:-1:1),x)
y
a1(1:N-1)=a(2:N).*(2:N);%перва€ производна€
P=polyval(a1(N-1:-1:1),x);
%кубический сплайн
s=zeros(4,N-1);


for i=1:N-1
    s(4,i)=(  P(i+1)*(x(i+1)-x(i)) -2*(y(i+1)-y(i)) +P(i)*(x(i+1)-x(i)) )/((x(i+1)-x(i))^3);
    s(3,i)=(  -P(i+1)*(x(i+1)-x(i))*(x(i+1)+2*x(i)) +3*(y(i+1)-y(i))*(x(i+1)+x(i)) - P(i)*(x(i+1)-x(i) )*(2*x(i+1)+x(i) ))/(x(i+1)-x(i))^3;
    s(2,i)=(  P(i+1)*x(i)*(2*x(i+1)+x(i))*(x(i+1)-x(i)) -6*(y(i+1)-y(i))*x(i)*x(i+1) +P(i)*x(i+1)*(x(i+1)-x(i))*(x(i+1)+2*x(i)) )/((x(i+1)-x(i))^3);
    s(1,i)=(  -P(i+1)*(x(i))^2 *x(i+1)*(x(i+1)-x(i)) -y(i+1)*(x(i))^2*(3*x(i+1)-x(i)) -P(i)*(x(i+1)-x(i))*x(i)*(x(i+1))^2+y(i)*(x(i+1))^2*(x(i+1)-3*x(i)) )/((x(i+1)-x(i))^3);
end


s%коэффициенты кубического сплайна









